Repository: selfcan/StrokeMouse
Catalog: StrokeMouse/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ja, ko, ru, zh_hans, zh_hant

# permissions.openAutomation
source: Open Automation Settings
fr: Ouvrir les réglages d’automatisation
ja: 自動化設定を開く
ko: 자동화 설정 열기
ru: Открыть настройки автоматизации
zh_hans: 打开自动化设置
zh_hant: 開啟自動化設定

# permissions.engineStatus
source: Engine Status
fr: État du moteur
ja: エンジンの状態
ko: 엔진 상태
ru: Состояние движка
zh_hans: 引擎状态
zh_hant: 引擎狀態

# permissions.listening
source: Listening
fr: En écoute
ja: 監視中
ko: 수신 중
ru: Прослушивание
zh_hans: 监听中
zh_hant: 監聽中

# permissions.enabled
source: Enabled
fr: Activé
ja: 有効
ko: 활성화됨
ru: Включено
zh_hans: 已启用
zh_hant: 已啟用

# permissions.status
source: Status
fr: État
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# permissions.restartEngine
source: Restart Engine
fr: Relancer le moteur
ja: エンジンを再起動
ko: 엔진 재시작
ru: Перезапустить движок
zh_hans: 重启引擎
zh_hant: 重啟引擎

# common.yes
source: Yes
fr: Oui
ja: はい
ko: 예
ru: Да
zh_hans: 是
zh_hant: 是

# common.no
source: No
fr: Non
ja: いいえ
ko: 아니요
ru: Нет
zh_hans: 否
zh_hant: 否

# common.cancel
source: Cancel
fr: Annuler
ja: キャンセル
ko: 취소
ru: Отменить
zh_hans: 取消
zh_hant: 取消

# common.save
source: Save
fr: Enregistrer
ja: 保存
ko: 저장
ru: Сохранить
zh_hans: 保存
zh_hant: 儲存

# common.testAction
source: Test Action
fr: Tester l’action
ja: アクションをテスト
ko: 동작 테스트
ru: Проверить действие
zh_hans: 测试动作
zh_hant: 測試動作

# engine.idle
source: Idle
fr: Inactif
ja: 待機中
ko: 대기 중
ru: Неактивен
zh_hans: 空闲
zh_hant: 空閒

# engine.listening
source: Listening for gestures
fr: À l’écoute des gestes
ja: ジェスチャを監視しています
ko: 제스처 수신 중
ru: Прослушивание жестов
zh_hans: 正在监听手势
zh_hant: 正在監聽手勢

# engine.paused
source: Gestures paused
fr: Gestes en pause
ja: ジェスチャは一時停止中
ko: 제스처가 일시 정지됨
ru: Жесты приостановлены
zh_hans: 手势已暂停
zh_hant: 手勢已暫停

# engine.needPermission
source: Needs Accessibility permission
fr: Autorisation d’accessibilité requise
ja: アクセシビリティの許可が必要です
ko: 손쉬운 사용 권한이 필요함
ru: Требуется разрешение «Универсальный доступ»
zh_hans: 需要辅助功能权限
zh_hant: 需要輔助使用許可權

# engine.failed
source: Failed to start event tap
fr: Échec du démarrage de l’écoute d’événements
ja: イベントタップを開始できませんでした
ko: 이벤트 탭을 시작하지 못함
ru: Не удалось запустить перехват событий
zh_hans: 事件监听启动失败
zh_hant: 事件監聽啟動失敗

# engine.actionFailed
source: Gesture action failed
fr: Échec de l’action du geste
ja: ジェスチャアクションに失敗しました
ko: 제스처 동작을 실행하지 못함
ru: Не удалось выполнить действие жеста
zh_hans: 手势动作执行失败
zh_hant: 手勢動作執行失敗

# engine.noMatch
source: No matching gesture
fr: Aucun geste correspondant
ja: 一致するジェスチャがありません
ko: 일치하는 제스처 없음
ru: Нет подходящего жеста
zh_hans: 未匹配到手势
zh_hant: 未匹配到手勢

# engine.matched
source: Gesture matched
fr: Geste reconnu
ja: ジェスチャが一致しました
ko: 제스처가 일치함
ru: Жест распознан
zh_hans: 手势已匹配
zh_hant: 手勢已匹配

# about.tagline
source: Custom mouse gestures for macOS
fr: Gestes de souris personnalisés pour macOS
ja: macOS向けのカスタムマウスジェスチャ
ko: macOS를 위한 사용자 설정 마우스 제스처
ru: Настраиваемые жесты мыши для macOS
zh_hans: macOS 鼠标手势自定义工具
zh_hant: macOS 滑鼠手勢自定義工具

# about.version
source: Version
fr: N° de version
ja: バージョン
ko: 버전
ru: Версия
zh_hans: 版本
zh_hant: 版本

# about.copyright
source: Open source inspired utilities. Use at your own risk.
fr: Outils inspirés de l’open source. Utilisation à vos risques et périls.
ja: オープンソースに着想を得たユーティリティです。ご自身の責任でご利用ください。
ko: 오픈 소스에서 영감을 받은 유틸리티이며, 사용 책임은 사용자에게 있습니다.
ru: Утилиты по мотивам открытого ПО. Используйте на свой риск.
zh_hans: 开源灵感工具，请自行承担使用风险。
zh_hant: 開源靈感工具，請自行承擔使用風險。

# about.reportIssue
source: Report Issue
fr: Signaler un problème
ja: 問題を報告
ko: 문제 보고
ru: Сообщить о проблеме
zh_hans: 报告问题
zh_hant: 報告問題

# about.license
source: License
fr: Licence
ja: ライセンス
ko: 라이선스
ru: Лицензия
zh_hans: 许可证
zh_hant: 許可證

# onboarding.welcome.title
source: Welcome to StrokeMouse
fr: Bienvenue dans StrokeMouse
ja: StrokeMouseへようこそ
ko: StrokeMouse에 오신 것을 환영합니다
ru: Добро пожаловать в StrokeMouse
zh_hans: 欢迎使用 StrokeMouse
zh_hant: 歡迎使用 StrokeMouse

# onboarding.welcome.subtitle
source: Hold a mouse button, draw a stroke, release — your custom action fires.
fr: Maintenez un bouton de la souris, dessinez un tracé, relâchez : votre action personnalisée s’exécute.
ja: マウスボタンを押しながら軌跡を描き、離すとカスタムアクションが実行されます。
ko: 마우스 버튼을 누른 채 스트로크를 그린 다음 놓으면 사용자 설정 동작이 실행됩니다.
ru: Удерживайте кнопку мыши, нарисуйте траекторию и отпустите — выполнится ваше действие.
zh_hans: 按住鼠标按键，画出轨迹，松开即可触发自定义动作。
zh_hant: 按住滑鼠按鍵，畫出軌跡，鬆開即可觸發自定義動作。

# onboarding.permission.title
source: Enable Accessibility
fr: Activer l’Accessibilité
ja: アクセシビリティを有効にする
ko: 손쉬운 사용 켜기
ru: Включите Универсальный доступ
zh_hans: 开启辅助功能权限
zh_hant: 開啟輔助使用許可權

# onboarding.permission.body
source: StrokeMouse needs Accessibility to listen for mouse buttons and run gestures. We’ll open System Settings and show a helper so you can drag the app into the list.
fr: StrokeMouse a besoin de l’Accessibilité pour écouter les boutons de la souris et exécuter les gestes. Nous ouvrirons Réglages Système et afficherons un assistant pour que vous puissiez glisser l’app dans la liste.
ja: StrokeMouseがマウスボタンを監視してジェスチャを実行するには、アクセシビリティが必要です。システム設定を開き、アプリをリストにドラッグできるよう補助パネルを表示します。
ko: StrokeMouse는 마우스 버튼을 수신하고 제스처를 실행하려면 손쉬운 사용이 필요하며, 시스템 설정을 열고 앱을 목록에 끌어 넣을 수 있도록 도우미를 표시합니다.
ru: StrokeMouse требуется «Универсальный доступ», чтобы отслеживать кнопки мыши и выполнять жесты. Мы откроем «Системные настройки» и покажем вспомогательную панель, чтобы вы могли перетащить приложение в список.
zh_hans: StrokeMouse 需要「辅助功能」权限才能监听鼠标按键并执行手势，我们会打开系统设置，并显示悬浮辅助面板，方便你把应用拖入列表。
zh_hant: StrokeMouse 需要「輔助使用」許可權才能監聽滑鼠按鍵並執行手勢，我們會開啟系統設定，並顯示懸浮輔助面板，方便你把應用拖入列表。

# onboarding.permission.granted
source: Accessibility is granted. Gesture listening can start.
fr: L’Accessibilité est autorisée. L’écoute des gestes peut commencer.
ja: アクセシビリティは許可済みです。ジェスチャの監視を開始できます。
ko: 손쉬운 사용이 허용되어 제스처 수신을 시작할 수 있습니다.
ru: Универсальный доступ разрешён. Можно начать прослушивание жестов.
zh_hans: 辅助功能已授权，可以开始手势监听。
zh_hant: 輔助使用已授權，可以開始手勢監聽。

# onboarding.permission.statusWaiting
source: Waiting for permission…
fr: En attente de l’autorisation…
ja: 許可を待っています…
ko: 권한 대기 중…
ru: Ожидание разрешения…
zh_hans: 等待授权…
zh_hant: 等待授權…

# onboarding.permission.statusGranted
source: Granted
fr: Autorisé
ja: 許可済み
ko: 허용됨
ru: Разрешено
zh_hans: 已授权
zh_hant: 已授權

# onboarding.permission.tip1
source: Click “Guide Me” to open Privacy → Accessibility.
fr: Cliquez sur « Me guider » pour ouvrir Confidentialité et sécurité → Accessibilité.
ja: 「案内する」をクリックして「プライバシーとセキュリティ → アクセシビリティ」を開きます。
ko: ‘안내 시작’을 클릭하여 개인 정보 보호 → 손쉬운 사용을 엽니다.
ru: Нажмите «Помочь настроить», чтобы открыть «Конфиденциальность → Универсальный доступ».
zh_hans: 点击「引导授权」打开「隐私与安全性 → 辅助功能」。
zh_hant: 點選「引導授權」開啟「隱私與安全性 → 輔助使用」。

# onboarding.permission.tip2
source: Drag StrokeMouse from the floating panel into the list.
fr: Glissez StrokeMouse depuis le panneau flottant vers la liste.
ja: フローティングパネルからStrokeMouseをリストへドラッグします。
ko: 플로팅 패널에서 StrokeMouse를 목록으로 끌어다 놓습니다.
ru: Перетащите StrokeMouse из плавающей панели в список.
zh_hans: 从悬浮面板把 StrokeMouse 拖入授权列表。
zh_hant: 從懸浮面板把 StrokeMouse 拖入授權列表。

# onboarding.permission.tip3
source: Turn the toggle on — this screen updates automatically.
fr: Activez l’option : cet écran se met à jour automatiquement.
ja: スイッチをオンにすると、この画面の状態が自動で更新されます。
ko: 스위치를 켜면 이 화면이 자동으로 업데이트됩니다.
ru: Включите переключатель — этот экран обновится автоматически.
zh_hans: 打开开关 — 本页会自动更新状态。
zh_hant: 開啟開關 — 本頁會自動更新狀態。

# onboarding.permission.authorize
source: Guide Me
fr: Me guider
ja: 案内する
ko: 안내 시작
ru: Помочь настроить
zh_hans: 引导授权
zh_hant: 引導授權

# onboarding.permission.skip
source: Skip for now
fr: Plus tard
ja: あとで設定
ko: 나중에 하기
ru: Позже
zh_hans: 稍后再说
zh_hant: 稍後再說

# onboarding.demo.title
source: How a gesture works
fr: Fonctionnement d’un geste
ja: ジェスチャの使い方
ko: 제스처 사용 방법
ru: Как работает жест
zh_hans: 手势怎么用
zh_hant: 手勢怎麼用

# onboarding.demo.subtitle
source: Each gesture has its own trigger button (default: right click). Hold, draw the path, then release.
fr: Chaque geste a son propre bouton de déclenchement (par défaut : clic droit). Maintenez, dessinez le tracé, puis relâchez.
ja: 各ジェスチャには独自のトリガーボタンがあります（デフォルトは右ボタン）。押したまま軌跡を描き、離して実行します。
ko: 각 제스처마다 트리거 버튼이 있으며(기본값: 오른쪽 클릭), 누른 채 경로를 그린 다음 놓으세요.
ru: У каждого жеста своя кнопка триггера (по умолчанию: правая кнопка). Удерживайте, нарисуйте траекторию, затем отпустите.
zh_hans: 每个手势有自己的触发键（默认右键），按住 → 画出轨迹 → 松开执行。
zh_hant: 每個手勢有自己的觸發鍵（預設右鍵），按住 → 畫出軌跡 → 鬆開執行。

# onboarding.demo.hold
source: Hold
fr: Maintenir
ja: 押し続ける
ko: 누르기
ru: Удерживать
zh_hans: 按住
zh_hant: 按住

# onboarding.demo.draw
source: Draw
fr: Dessiner
ja: 描く
ko: 그리기
ru: Рисовать
zh_hans: 绘制
zh_hant: 繪製

# onboarding.demo.release
source: Release
fr: Relâcher
ja: 離す
ko: 놓기
ru: Отпустить
zh_hans: 松开
zh_hant: 鬆開

# onboarding.done.titleReady
source: You’re all set
fr: Tout est prêt
ja: 準備完了です
ko: 준비 완료
ru: Всё готово
zh_hans: 一切就绪
zh_hant: 一切就緒

# onboarding.done.titlePartial
source: Almost there
fr: Presque terminé
ja: もう少しです
ko: 거의 다 됐습니다
ru: Почти готово
zh_hans: 还差一步
zh_hant: 還差一步

# onboarding.done.bodyReady
source: Open Settings anytime to tweak gestures. Happy stroking!
fr: Ouvrez les Réglages à tout moment pour ajuster vos gestes, et bon dessin !
ja: 設定からいつでもジェスチャを調整できます。さっそく描いてみましょう！
ko: 언제든지 설정에서 제스처를 조정할 수 있으니, 마음껏 그려 보세요!
ru: Откройте «Настройки» в любое время, чтобы подправить жесты. Приятного рисования!
zh_hans: 随时可在设置中调整手势，开始绘制吧！
zh_hant: 隨時可在設定中調整手勢，開始繪製吧！

# onboarding.done.bodyPartial
source: Gestures won’t run until Accessibility is granted. Use the menu bar item or Permissions tab to finish setup.
fr: Les gestes ne fonctionneront pas tant que l’Accessibilité n’est pas accordée ; utilisez l’élément de la barre des menus ou l’onglet Autorisations pour terminer la configuration.
ja: アクセシビリティが許可されるまでジェスチャは動作しません。メニューバーまたは「権限」タブから設定を完了してください。
ko: 손쉬운 사용이 허용되기 전에는 제스처가 실행되지 않으며, 메뉴 막대 항목이나 권한 탭에서 설정을 마칠 수 있습니다.
ru: Жесты не будут работать, пока не разрешён Универсальный доступ; завершите настройку через значок в строке меню или вкладку «Доступ».
zh_hans: 未授予辅助功能前手势无法运行，可从菜单栏或「权限」页完成授权。
zh_hant: 未授予輔助使用前手勢無法執行，可從選單欄或「許可權」頁完成授權。

# onboarding.done.listening
source: Listening for gestures
fr: À l’écoute des gestes
ja: ジェスチャを監視しています
ko: 제스처 수신 중
ru: Прослушивание жестов
zh_hans: 正在监听手势
zh_hant: 正在監聽手勢

# onboarding.next
source: Continue
fr: Continuer
ja: 続ける
ko: 계속
ru: Продолжить
zh_hans: 继续
zh_hant: 繼續

# onboarding.back
source: Back
fr: Retour
ja: 戻る
ko: 뒤로
ru: Назад
zh_hans: 返回
zh_hant: 返回

# onboarding.skip
source: Skip
fr: Ignorer
ja: スキップ
ko: 건너뛰기
ru: Пропустить
zh_hans: 跳过
zh_hant: 跳過

# onboarding.continue
source: Get Started
fr: Commencer
ja: 始める
ko: 시작하기
ru: Начать работу
zh_hans: 开始使用
zh_hant: 開始使用

# permissions.authorizeWithGuide
source: Guide Me
fr: Me guider
ja: 案内する
ko: 안내 시작
ru: Помочь с доступом
zh_hans: 引导授权
zh_hant: 引導授權

# editor.basic
source: Basics
fr: Informations
ja: 基本
ko: 기본
ru: Основное
zh_hans: 基础
zh_hant: 基礎

# editor.name
source: Name
fr: Nom
ja: 名前
ko: 이름
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# editor.enabled
source: Enabled
fr: Activé
ja: 有効
ko: 활성화
ru: Включено
zh_hans: 启用
zh_hant: 啟用

# editor.trigger
source: Trigger Button
fr: Bouton de déclenchement
ja: トリガーボタン
ko: 트리거 버튼
ru: Кнопка триггера
zh_hans: 触发按键
zh_hant: 觸發按鍵

# editor.pattern
source: Pattern
fr: Motif
ja: パターン
ko: 패턴
ru: Шаблон
zh_hans: 手势图案
zh_hant: 手勢圖案

# editor.patternType
source: Type
fr: Catégorie
ja: 種類
ko: 유형
ru: Тип
zh_hans: 类型
zh_hant: 型別

# editor.pattern.directions
source: Directions
fr: Par directions
ja: 方向
ko: 방향
ru: Направления
zh_hans: 方向序列
zh_hant: 方向序列

# editor.pattern.freePath
source: Free Path
fr: Tracé libre
ja: フリーパス
ko: 자유 경로
ru: Свободная траектория
zh_hans: 自由轨迹
zh_hant: 自由軌跡

# editor.directionsHint
source: up,right,down…
fr: ex. : up,right,down…
ja: 例: up,right,down…
ko: 예: up,right,down…
ru: напр.: up,right,down…

# editor.directionsHelp
source: Comma-separated: up, down, left, right, upLeft, upRight, downLeft, downRight.
fr: Séparés par des virgules : up, down, left, right, upLeft, upRight, downLeft, downRight.
ja: カンマ区切り: up, down, left, right, upLeft, upRight, downLeft, downRight。
ko: 쉼표로 구분: up, down, left, right, upLeft, upRight, downLeft, downRight.
ru: Через запятую: up, down, left, right, upLeft, upRight, downLeft, downRight.
zh_hans: 逗号分隔：up, down, left, right, upLeft, upRight, downLeft, downRight。
zh_hant: 逗號分隔：up, down, left, right, upLeft, upRight, downLeft, downRight。

# editor.freePathHelp
source: Draw a template path in the canvas. Matching uses normalize + DTW/resample scoring.
fr: Dessinez un tracé modèle dans la zone de dessin. La correspondance utilise une normalisation et un score DTW/rééchantillonnage.
ja: キャンバスにテンプレートの軌跡を描きます。照合は正規化とリサンプル/DTWのスコアを使います。
ko: 캔버스에 템플릿 경로를 그리며, 일치는 정규화 + DTW/리샘플 점수를 사용합니다.
ru: Нарисуйте шаблон траектории на холсте; сопоставление использует нормализацию и оценку DTW/передискретизации.
zh_hans: 在画布中绘制模板轨迹，匹配使用归一化 + 重采样/DTW 打分。
zh_hant: 在畫布中繪製模板軌跡，匹配使用歸一化 + 重取樣/DTW 打分。

# editor.drawHere
source: Draw gesture template here
fr: Dessinez le modèle de geste ici
ja: ここにジェスチャのテンプレートを描きます
ko: 여기에 제스처 템플릿을 그리세요
ru: Нарисуйте шаблон жеста здесь
zh_hans: 在此绘制手势模板
zh_hant: 在此繪製手勢模板

# editor.pointCount
source: Points
fr: Nombre de points
ja: 点数
ko: 점 개수
ru: Точки
zh_hans: 点数
zh_hant: 點數

# editor.saveNeedsPath
source: Draw a gesture path on the left before saving.
fr: Dessinez d’abord un tracé à gauche avant d’enregistrer.
ja: 保存する前に、左側でジェスチャの軌跡を描いてください。
ko: 저장하기 전에 왼쪽에서 제스처 경로를 그리세요.
ru: Сначала нарисуйте траекторию жеста слева, затем сохраните.
zh_hans: 请先在左侧绘制手势轨迹后再保存。
zh_hant: 請先在左側繪製手勢軌跡後再儲存。

# editor.clear
source: Clear
fr: Effacer
ja: 消去
ko: 지우기
ru: Очистить
zh_hans: 清除
zh_hant: 清除

# editor.action
source: Action
fr: Action à exécuter
ja: アクション
ko: 동작
ru: Действие
zh_hans: 动作
zh_hant: 動作

# editor.target
source: Gesture Target
fr: Cible du geste
ja: ジェスチャの対象
ko: 제스처 대상
ru: Цель жеста
zh_hans: 手势目标
zh_hant: 手勢目標

# editor.targetWindow
source: Target
fr: Cible
ja: 対象
ko: 대상
ru: Цель
zh_hans: 目标
zh_hant: 目標

# target.frontmostWindow
source: Frontmost App
fr: App au premier plan
ja: 最前面のアプリ
ko: 전면 앱
ru: Переднее приложение
zh_hans: 当前前台应用
zh_hant: 當前前臺應用

# target.windowUnderPointer
source: App Under Pointer
fr: App sous le pointeur
ja: ポインタ下のアプリ
ko: 포인터 아래 앱
ru: Приложение под указателем
zh_hans: 指针位置所属应用
zh_hant: 指標位置所屬應用

# editor.targetHelp.frontmostWindow
source: Freeze the frontmost app when the trigger is pressed, plus its active window when one is available.
fr: Verrouille l’app au premier plan à l’appui du déclencheur, ainsi que sa fenêtre active si elle est disponible.
ja: トリガーを押した時点の最前面のアプリを固定します。アクティブなウインドウがあれば、そのウインドウも固定します。
ko: 트리거를 누를 때 전면 앱을 고정하고, 활성 윈도우가 있으면 해당 윈도우도 함께 고정합니다.
ru: При нажатии триггера фиксируется переднее приложение и его активное окно, если оно есть.
zh_hans: 按下触发键时锁定当前前台应用；若存在活动窗口，则同时锁定该窗口。
zh_hant: 按下觸發鍵時鎖定當前前臺應用；若存在活動視窗，則同時鎖定該視窗。

# editor.targetHelp.windowUnderPointer
source: Freeze the app under the pointer when the trigger is pressed, plus the exact window when one is available.
fr: Verrouille l’app sous le pointeur à l’appui du déclencheur, ainsi que la fenêtre exacte si elle est disponible.
ja: トリガーを押した時点でポインタ下のアプリを固定します。通常のウインドウがあれば、そのウインドウも固定します。
ko: 트리거를 누를 때 포인터 아래 앱을 고정하고, 해당 윈도우가 있으면 정확한 윈도우도 함께 고정합니다.
ru: При нажатии триггера фиксируется приложение под указателем и точное окно, если оно есть.
zh_hans: 按下触发键时锁定指针位置所属应用；若存在普通窗口，则同时锁定该窗口。
zh_hant: 按下觸發鍵時鎖定指標位置所屬應用；若存在普通視窗，則同時鎖定該視窗。

# editor.targetPointerShortcutWarning
source: Shortcuts bring the frozen app to the front and, when available, its exact window. This may switch focus or Spaces.
fr: Les raccourcis amènent l’app verrouillée au premier plan et, si possible, sa fenêtre exacte ; cela peut changer le focus ou l’espace.
ja: ショートカットは固定したアプリを最前面にします。可能な場合はそのウインドウも最前面になるため、フォーカスやスペースが切り替わることがあります。
ko: 단축키는 고정된 앱을 전면으로 가져오고, 가능한 경우 정확한 윈도우도 가져오므로 포커스나 공간이 바뀔 수 있습니다.
ru: Сочетания клавиш выводят зафиксированное приложение на передний план и, если доступно, его точное окно; из‑за этого может смениться фокус или рабочий стол Spaces.
zh_hans: 快捷键会先将锁定应用置于前台；若有精确窗口，也会置前该窗口，因此可能切换焦点或桌面空间。
zh_hant: 快捷鍵會先將鎖定應用置於前臺；若有精確視窗，也會置前該視窗，因此可能切換焦點或桌面空間。

# editor.testActionNeedsTarget
source: This action needs target context captured at gesture start. Save, then perform the gesture to test it.
fr: Cette action nécessite le contexte de cible capturé au début du geste ; enregistrez, puis exécutez le geste pour la tester.
ja: このアクションには、ジェスチャ開始時に取り込んだ対象の情報が必要です。保存したあと、実際のジェスチャでテストしてください。
ko: 이 동작은 제스처 시작 시 캡처된 대상 맥락이 필요하므로, 저장한 뒤 실제 제스처로 테스트하세요.
ru: Этому действию нужен контекст цели, захваченный в начале жеста; сохраните жест и выполните его, чтобы проверить.
zh_hans: 此动作需要在手势开始时捕获目标上下文，请保存后用真实手势测试。
zh_hant: 此動作需要在手勢開始時捕獲目標上下文，請儲存後用真實手勢測試。

# editor.scope
source: Application Scope
fr: Portée des apps
ja: アプリケーション範囲
ko: 앱 범위
ru: Область приложений
zh_hans: 应用范围
zh_hant: 應用範圍

# editor.scopeGlobal
source: Global (all apps)
fr: Global (toutes les apps)
ja: グローバル（すべてのアプリ）
ko: 전체 (모든 앱)
ru: Глобально (все приложения)
zh_hans: 全局（所有应用）
zh_hant: 全域性（所有應用）

# editor.scopeEmpty
source: No apps selected. This gesture will not match any app until you add at least one.
fr: Aucune app sélectionnée ; ce geste ne correspondra à aucune app tant que vous n’en aurez pas ajouté au moins une.
ja: アプリが選択されていません。少なくとも1つ追加するまで、このジェスチャはどのアプリにも一致しません。
ko: 선택한 앱이 없으며, 하나 이상 추가해야 이 제스처가 앱과 일치합니다.
ru: Приложения не выбраны: жест не будет срабатывать, пока вы не добавите хотя бы одно.
zh_hans: 尚未选择应用，添加至少一个应用后，该手势才会生效。
zh_hant: 尚未選擇應用，新增至少一個應用後，該手勢才會生效。

# editor.scopeAddApps
source: Add Apps…
fr: Ajouter des apps…
ja: アプリを追加…
ko: 앱 추가…
ru: Добавить приложения…
zh_hans: 添加应用…
zh_hant: 新增應用…

# editor.scopeAppCount
source: %d app(s)
fr: %d application(s)
ja: %d個のアプリ
ko: 앱 %d개
ru: %d прилож.
zh_hans: %d 个应用
zh_hant: %d 個應用

# editor.scopeHelp
source: When Global is off, this gesture only runs when the selected target belongs to one of these apps.
fr: Lorsque Global est désactivé, ce geste ne s’exécute que si la cible sélectionnée appartient à l’une de ces apps.
ja: グローバルをオフにすると、選択したジェスチャ対象が次のアプリのいずれかに属するときだけ、このジェスチャが実行されます。
ko: 전체를 끄면 선택한 대상이 다음 앱 중 하나에 속할 때만 이 제스처가 실행됩니다.
ru: Если режим «Глобально» выключен, жест выполняется только когда выбранная цель принадлежит одному из этих приложений.
zh_hans: 关闭全局后，仅当所选手势目标属于以下应用时，此手势才会生效。
zh_hant: 關閉全域性後，僅當所選手勢目標屬於以下應用時，此手勢才會生效。

# editor.scopeRemoveApp
source: Remove
fr: Retirer
ja: 取り除く
ko: 제거
ru: Удалить
zh_hans: 移除
zh_hant: 移除

# editor.scopePickerTitle
source: Select Applications
fr: Sélectionner des apps
ja: アプリケーションを選択
ko: 앱 선택
ru: Выбрать приложения
zh_hans: 选择应用
zh_hant: 選擇應用

# editor.scopeSearch
source: Search by name or bundle ID
fr: Rechercher par nom ou Bundle ID
ja: 名前またはBundle IDで検索
ko: 이름 또는 Bundle ID로 검색
ru: Поиск по имени или Bundle ID
zh_hans: 按名称或 Bundle ID 搜索
zh_hant: 按名稱或 Bundle ID 搜尋

# editor.scopePickerEmpty
source: No matching apps
fr: Aucune app correspondante
ja: 一致するアプリがありません
ko: 일치하는 앱 없음
ru: Нет подходящих приложений
zh_hans: 没有匹配的应用
zh_hant: 沒有匹配的應用

# editor.scopeAlreadyAdded
source: Added
fr: Déjà ajouté
ja: 追加済み
ko: 추가됨
ru: Добавлено
zh_hans: 已添加
zh_hant: 已新增

# editor.scopeBrowse
source: Browse…
fr: Parcourir…
ja: 選択…
ko: 둘러보기…
ru: Обзор…
zh_hans: 浏览…
zh_hant: 瀏覽…

# editor.scopeSelectedCount
source: %d selected
fr: %d sélectionnée(s)
ja: %d件選択
ko: %d개 선택됨
ru: Выбрано: %d
zh_hans: 已选 %d 个
zh_hant: 已選 %d 個

# editor.scopeConfirm
source: Add
fr: Ajouter
ja: 追加
ko: 추가
ru: Добавить
zh_hans: 添加
zh_hant: 新增

# editor.notes
source: Notes
fr: Remarques
ja: メモ
ko: 메모
ru: Заметки
zh_hans: 备注
zh_hant: 備註

source: Action Type
fr: Type d’action
ja: アクションの種類
ko: 동작 유형
ru: Тип действия
zh_hans: 动作类型
zh_hant: 動作型別

# action.none
source: None
fr: Aucune
ja: なし
ko: 없음
ru: Нет
zh_hans: 无
zh_hant: 無

# action.shortcut
source: Keyboard Shortcut
fr: Raccourci clavier
ja: キーボードショートカット
ko: 키보드 단축키
ru: Сочетание клавиш
zh_hans: 键盘快捷键
zh_hant: 鍵盤快捷鍵

# action.shortcutExecutionFailed
source: Failed to create keyboard shortcut events
fr: Impossible de créer les événements du raccourci clavier
ja: キーボードショートカットイベントを作成できませんでした
ko: 키보드 단축키 이벤트를 만들지 못했습니다
ru: Не удалось создать события сочетания клавиш
zh_hans: 键盘快捷键事件创建失败
zh_hant: 鍵盤快捷鍵事件建立失敗

# action.targetUnavailable
source: The window captured for this gesture is no longer available.
fr: La fenêtre capturée pour ce geste n’est plus disponible.
ja: このジェスチャで取り込んだウインドウは、もう利用できません。
ko: 이 제스처에서 캡처한 윈도우를 더 이상 사용할 수 없습니다.
ru: Окно, захваченное для этого жеста, больше недоступно.
zh_hans: 此手势捕获的窗口已不可用。
zh_hant: 此手勢捕獲的視窗已不可用。

# action.targetActivationFailed
source: The target app rejected the activation request.
fr: L’app cible a refusé la demande d’activation.
ja: 対象のアプリがアクティブ化の要求を拒否しました。
ko: 대상 앱이 활성화 요청을 거부했습니다.
ru: Целевое приложение отклонило запрос на активацию.
zh_hans: 目标应用拒绝了激活请求。
zh_hant: 目標應用拒絕了啟用請求。

# action.targetActivationTimedOut
source: Timed out while activating the target app.
fr: Délai dépassé lors de l’activation de l’app cible.
ja: 対象のアプリのアクティブ化がタイムアウトしました。
ko: 대상 앱을 활성화하는 동안 시간이 초과되었습니다.
ru: Истекло время ожидания при активации целевого приложения.
zh_hans: 激活目标应用超时。
zh_hant: 啟用目標應用超時。

# action.targetFocusChanged
source: The captured window did not become focused, so the shortcut was not sent.
fr: La fenêtre capturée n’a pas obtenu le focus, le raccourci n’a donc pas été envoyé.
ja: 取り込んだウインドウがフォーカスされなかったため、ショートカットは送信されませんでした。
ko: 캡처한 윈도우가 포커스를 받지 못해 단축키를 보내지 않았습니다.
ru: Захваченное окно не получило фокус, поэтому сочетание не было отправлено.
zh_hans: 捕获的窗口未获得焦点，因此没有发送快捷键。
zh_hant: 捕獲的視窗未獲得焦點，因此沒有傳送快捷鍵。

# action.targetWindowControlUnavailable
source: The captured window does not support this action.
fr: La fenêtre capturée ne prend pas en charge cette action.
ja: 取り込んだウインドウはこのアクションに対応していません。
ko: 캡처한 윈도우는 이 동작을 지원하지 않습니다.
ru: Захваченное окно не поддерживает это действие.
zh_hans: 捕获的窗口不支持此动作。
zh_hant: 捕獲的視窗不支援此動作。

# action.targetHasNoOperableWindow
source: The captured target app has no operable window for this action.
fr: L’app cible capturée n’a aucune fenêtre utilisable pour cette action.
ja: 取り込んだ対象アプリには、このアクションで操作できるウインドウがありません。
ko: 캡처한 대상 앱에 이 동작으로 조작할 윈도우가 없습니다.
ru: У захваченного приложения нет окна, с которым можно выполнить это действие.
zh_hans: 捕获的目标应用没有可供此动作操作的窗口。
zh_hant: 捕獲的目標應用沒有可供此動作操作的視窗。

# action.targetOperationFailed
source: Could not operate on the captured window.
fr: Impossible d’agir sur la fenêtre capturée.
ja: 取り込んだウインドウを操作できませんでした。
ko: 캡처한 윈도우를 조작할 수 없습니다.
ru: Не удалось выполнить операцию с захваченным окном.
zh_hans: 无法操作捕获的窗口。
zh_hant: 無法操作捕獲的視窗。

# action.appNotFound
source: The selected application could not be found.
fr: L’application sélectionnée est introuvable.
ja: 選択したアプリケーションが見つかりませんでした。
ko: 선택한 앱을 찾을 수 없습니다.
ru: Выбранное приложение не найдено.
zh_hans: 找不到所选应用。
zh_hant: 找不到所選應用。

# action.invalidURL
source: The URL is invalid.
fr: L’URL n’est pas valide.
ja: URLが無効です。
ko: URL이 올바르지 않습니다.
ru: Недопустимый URL.
zh_hans: URL 无效。
zh_hant: URL 無效。

# action.openFailed
source: The item could not be opened.
fr: Impossible d’ouvrir cet élément.
ja: 項目を開けませんでした。
ko: 해당 항목을 열 수 없습니다.
ru: Не удалось открыть этот элемент.
zh_hans: 无法打开该项目。
zh_hant: 無法開啟該專案。

# action.openApp
source: Open App
fr: Ouvrir une app
ja: アプリを開く
ko: 앱 열기
ru: Открыть приложение
zh_hans: 打开应用
zh_hant: 開啟應用

# action.openURL
source: Open URL
fr: Ouvrir une URL
ja: URLを開く
ko: URL 열기
ru: Открыть URL
zh_hans: 打开 URL
zh_hant: 開啟 URL

# action.shell
source: Shell Command
fr: Commande Shell
ja: Shellコマンド
ko: Shell 명령어
ru: Команда Shell
zh_hans: Shell 命令
zh_hant: Shell 命令

# action.media
source: Media Key
fr: Touche multimédia
ja: メディアキー
ko: 미디어 키
ru: Медиаклавиша
zh_hans: 媒体键
zh_hant: 媒體鍵

# action.window
source: Window Action
fr: Action de fenêtre
ja: ウインドウ操作
ko: 윈도우 동작
ru: Действие с окном
zh_hans: 窗口操作
zh_hant: 視窗操作
